Repository: 84000/translation-memory-resources
Catalog: post_input/toh101.bo.en.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཀུན་ དུ་ སྦས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Thoroughly Hidden.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ སྣང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $496 Situated beyond that universe was a universe known as Ratnāloka .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རི་རབ་ འོད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Light of the King of Mountains.

source: བཅོམ་ལྡན་ འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཤིན་ཏུ་ རབ་གནས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supratiṣṭhita.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ ཀུན་ གྱིས་ བརྒྱན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $497 Situated beyond that universe was a universe known as Adorned with All Good Qualities.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ སྨན་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Medicine.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བྱང་ཆུབ་ ཡན་ལག་ བརྒྱན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $498 Situated beyond that universe was a universe known as Bodhyaṅgā­laṃkāra.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མངོན་པར་ འཕགས་པ ས་ འགྲོ་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: There resided the thus-gone Superior Movement. |#| Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ ལེགས་པ ར་ བསམ་པ་ སེམས་པ་ ཁྱད་པར་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Special Intelligence of Excellent Concern and Attention.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྡུལ་ དང་ བྲལ་བ འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $499 Situated beyond that universe was a universe known as Virajamati.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མེ་ཏོག་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: There resided the thus-gone Splendor of the Growth of Precious Flowers. |#| Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཁྱད་པར་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Special Gift.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྤྲིན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $500 Situated beyond that universe was a universe known as Megha .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཐའ་ ཡ ས་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་ |#| འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: There resided the thus-gone Anantavikrāmin. |#| Abiding and remaining present there, he taught the Dharma.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དྲན་པ་ རྙེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Attainment of Recollection.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ དྲ་བ ས་ ཀུན་ ཏུ་ གཡོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $501 Situated beyond that universe was a universe known as Covered in Flower Nets. [77.a]

source: དེ་ ན་ དེ་བཞིན་ [77a] གཤེགས་པ་ སེམས་ཅན་ ཐམས་ཅད་ མོས་པ འི་ གོ་ཆ་ བགོས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Bearer of the Armor of Caring for All Beings.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྒྱུ་སྐར་ གྱི་ ཕྲེང་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $502 Situated beyond that universe was a universe known as Nakṣatravali .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ གདུགས་ མངོན་པར་ འཕགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Superior Jewel Parasol.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མྱ་ངན་མེད་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Aśoka.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ མེ་ཏོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $503 Situated beyond that universe was a universe known as Ratnapuṣpa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vṛṣabha.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ནས་ སྤོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $504 Situated beyond that universe was a universe known as Permeated by Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ བདུད་རྩི འི་ མེ་ཏོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Nectar Flower.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤོས་ ཀྱི་ གླང་པོ་ཆེ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Gandhahastī.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $505 Situated beyond that universe was a universe known as Flower .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ །_
en: There resided the thus-gone Ratnavṛṣabha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མྱ་ངན་ བྲལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Vigataśoka.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རིན་ཆེན་ སྣ་ཚོགས་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $506 Situated beyond that universe was a universe known as Banner of Numerous Jewels.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཟླ་བ་ འཕགས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Moon of Superior Glory.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཐའ་ ཡ ས་ སྒྱུར་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Infinite Transformer.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་དུ་ བགྲོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $507 Situated beyond that universe was a universe known as Traversal.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སེམས་བསྐྱེད་ མ་ ཐག་ ཏུ་ ཆོས་ ཀྱི་ འཁོར་ལོ་ བསྐོར་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Saha­cittotpāda­dharma­cakra­pravartin .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཕྱིར་ མི་ ལྡོག་པ འི་ འཁོར་ [77b] ལོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Irreversible Wheel. [77.b]

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་ལྡན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $508 Situated beyond that universe was a universe known as Sukhāvatī .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕྱོགས་ སུ་ རྣམ་པར་ བསྒྲགས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Universally Renowned.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ ཚབ་ ཡེ་ཤེས་ རྣམ་པར་ བསྒྲགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Wisdom Renown.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྡོ་རྗེ འི་ སྙིང་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $509 Situated beyond that universe was a universe known as Vajragarbha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཀ་ ལིང་ ཀ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Kaliṅgarāja.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཁྱད་པར་ དུ་ འགྲོ་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Viśeṣagāmin.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $510 Situated beyond that universe was a universe known as Sukha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཉི་མ འི་ དཀྱིལ་འཁོར་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Lamp of the Sun Disk.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཟླ་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Candra.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་པོ་ཆེ འི་ མཆོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Supreme Jewel.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་ དཔའ་ རྒྱལ་ཚབ་ མེས་ བྱིན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Agnidatta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ འབྱུང་གནས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $512 Situated beyond that universe was a universe known as Ākara.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Śrījñānākara.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jñānaśrī.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཅིག་ ཏུ་ བདེ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $513 Situated beyond that universe was a universe known as Singularly Blissful.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡོན་ཏན་ གྱི་ རྒྱལ་པོ་ རབ་ཏུ་ གནས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Stable Presence of the King of Qualities.

source: བཅོམ་ ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མི་ འཇིགས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Abhaya.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གདུགས་ ཀྱི་ ཕྲེང་བ་ མེ་ཏོག་ ཀུན་ ཏུ་ རྒྱས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $514 Situated beyond that universe was a universe known as Parasol Garland of Blooming Flowers.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐོགས་པ་ མེད་པ འི་ སྤྱན་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Unhindered Eyes.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ ཆོས་ [78a] ཀྱང་ སྟོན་ ཏེ །_
en: Abiding and remaining present there, he taught the Dharma. [78.a]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མིག་ བཟངས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sunetra.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བྲག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Rock.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཟླ་བ་ འཕགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $516 Situated beyond that universe was a universe known as Superior Moon.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ ཀྱི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Jñānaśrī.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྟོབས་ བརྟན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Firm Strength.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ཏུ་འོད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $517 Situated beyond that universe was a universe known as Samantaprabha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ ཀྱི་ དཀྱིལ་འཁོར་ གཟི་བརྗིད་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendorous King of the Luminous Sphere.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྤྱོད་པ་ ཁྱད་པར་ཅན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Special Action.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཐོ་བ འི་ རྒྱལ་མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $518 Situated beyond that universe was a universe known as Lofty Banner.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྒྱུ འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Causal Intelligence.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྒྱུ་དག་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Pure Cause.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སྒྲོགས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $519 Situated beyond that universe was a universe known as Nirghoṣa .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྲེད་ མེད་ ཀྱི་ བུ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Nārāyaṇa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཁ་ལོ་ སྒྱུར་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Sārathi.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ དྲི་མ་ མེད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $520 Situated beyond that universe was a universe known as Vimala .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དྲི་མ་ མེད་པ འི་ མེ་ཏོག་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Stainless Flower.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ས་བོན་ འཆང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Bījadhara.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྡོ་རྗེ་ བཞེད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Vajra Wish.

source: འཚོ་ ཞིང་ གཞེས་ ལ་ [78b] ཆོས་ ཀྱང་ སྟོན་ ཏེ །_
en: Abiding and remaining present there, he taught the Dharma. [78.b]

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དྲི་མེད་ རྣམ་པར་ འཐོར་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Stainless Disperser.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེ་བ་ ཐམས་ཅད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $522 Situated beyond that universe was a universe known as All Bliss.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ དག་པ འི་ བློ་གྲོས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Viśuddhamati.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བཀོད་པ་ དུ་མ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Numerous Arrays.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མྱ་ངན་ དང་ གནོད་པ་ ཐམས་ཅད་ ཡོངས་སུ་ སྤངས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $523 Situated beyond that universe was a universe known as Devoid of Any Suffering and Harm.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཕན་ བཞེད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Benefactor .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ གླང་པོ་ཆེ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Śrīhasti.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཡོན་ཏན་ མཐའ་ ཡ ས་ ཡོངས་རྫོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $524 Situated beyond that universe was a universe known as Totality of Infinite Qualities.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཤིན་ཏུ་ ཡང་དག་ བརྟགས་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Armor of Perfect Analysis.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མཆོག་ གི་ བཀོད་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Supreme Array.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཉམ་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $525 Situated beyond that universe was a universe known as Equal .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་ རབ་ཏུ་ འཇོམས་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Conqueror of the Enemy.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཐོགས་པ་ མེད་པ འི་ གོ་ཆ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Unimpeded Armor.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བཟོད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $526 Situated beyond that universe was a universe known as Kṣānti.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྟག་ ཏུ་ བརྩོན་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Nityo­dyukta.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཕྱོགས་ ཀྱི་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $527 Situated beyond that universe was a universe known as Universal Lamp.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རྣམ་པར་ བསྒྲགས་པ འི་ སྟོབས་ ཀྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of Renowned Power.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཟླ་བ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བླ་ ན་ མེད་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཏུ་ ལུང་བསྟན་ ཏེ་ བཏང་ [79a] ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Candrarāja, having prophesied the latter’s awakening to unsurpassable, true buddhahood. [79.a]

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ སྣང་བར་ བྱས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $528 Situated beyond that universe was a universe known as Constantly Illuminated.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ མཐའ་ཡས་པ འི་ ལྷུན་པོ་ སྤོས་ ཀྱི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Incense King of the Infinite Mountain.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྟག་ ཏུ་ བརྒྱན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $529 Situated beyond that universe was a universe known as Constant Adornment.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མེ་ཏོག་ སྣ་ཚོགས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Flower Bouquet.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བདུད་རྩི འི་ དབྱངས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Amṛtaghoṣa.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གདུགས་དཀར་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $530 Situated beyond that universe was a universe known as White Parasol.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Amitābha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བརྩོན་པ་ མི་ གཏོང་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Anikṣiptadhura.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྐྱེས་པ་ དང་ བུད་མེད་ འགྱུར་བ ར་ མཛད་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Becoming Man and Woman.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ང་རོ་ མཐའ་ ཡ ས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Infinite Roar.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གཅིག་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $532 Situated beyond that universe was a universe known as Singular .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྤོས་ མཆོག་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Splendor of Supreme Incense.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལག་ ན་ སྤོས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Gandhapāṇi.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཙན་དན་ གྱི་ བསུང་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $533 Situated beyond that universe was a universe known as Sandalwood Fragrance .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of Superior Jewels.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ འོད་ཟེར་ དུ་མ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Manifold Light Rays.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ཏུ་ སྤོས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $534 Situated beyond that universe was a universe known as Constant Incense.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ རིན་ཆེན་ མངོན་པར་ འཕགས་པ འི་ རྒྱལ་པོ་ ཞེས་ བྱ་ [79b] བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone King of Superior Jewels.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རིན་ཆེན་ ལྷུན་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jewel Mountain.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ ཀུན་ ནས་ མཚན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $535 Situated beyond that universe was a universe known as Abundant Marks.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སེམས་ཅན་ ཀུན་ གྱི་ སེམས་ ཀྱི་ མོས་པ འི་ ཡེ་ཤེས་ མཐོང་བ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Wisdom Vision of the Wishes of All Beings.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ དེད་དཔོན་ ཆེན་པོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Mahāsārthavāha.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཚན་མ་ མེད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $536 Situated beyond that universe was a universe known as Animitta.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མཚན་མ་ མེད་པ འི་ ང་རོ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Roar of Signlessness.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཆོས་ ཐམས་ཅད་ དབེན་པ ར་ གནས་པ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Disengaged from All Phenomena.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ སངས་རྒྱས་ མེ་ཏོག་ བརྒྱན་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $537 Situated beyond that universe was a universe known as Buddha Flower Ornament.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཡེ་ཤེས་ སྦས་པ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Hidden Wisdom.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཡེ་ཤེས་ འོད་ཟེར་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Jñānaraśmi.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ རྒྱས་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $538 Situated beyond that universe was a universe known as Blooming Flower.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ བརྟན་པོ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $539 Situated beyond that universe was a universe known as Dṛḍha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ མིག་ གཡོ་ རྣམ་པར་ གནོན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Sharp Moving Eyes.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ལེགས་པ འི་ བློ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Excellent Mind.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ བརྟན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $540 Situated beyond that universe was a universe known as Dṛḍha.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འོད་སྲུང་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Kāśyapa .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ སྐར་མ འི་ སྒྲོན་མ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ulkāpradīpa.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ པད་ [80a] མ འི་ གདུགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $541 Situated beyond that universe was the universe [80.a] known as Parasol of the Blissful One.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དམིགས་པ་ ཀུན་ གྱི་ ཁྱུ་མཆོག་ སྟོན་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Teacher of the Chief among All Objects of Perception.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྣ་བ འི་ མེ་ཏོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ear Flower.

source: དེ འི་ ཡང་ འདབ་ ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ བདེན་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $542 Situated beyond that universe was a universe known as Satya.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ དོན་གྲུབ་ ཅེས་བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Siddhārtha.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ བདེན་པ་ མཐོང་བ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Satyadarśin.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་ རྟེན་ གྱི་ ཁམས་ ཟླ་བ་ ཅན་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $543 Situated beyond that universe was a universe known as Moon Possessor.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ འབྱུང་བ འི་ དཔལ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Glorious Source.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ ཀུན་དགའ་བོ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Ānanda.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ གནོད་པ་ མེད་པ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $544 Situated beyond that universe was a universe known as Free from Harm .

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ སྙན་པ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ །_
en: There resided the thus-gone Ghoṣa.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེ་ཏོག་ དཔལ་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Glorious Flower.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མངོན་པར་ དགའ་བ་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $545 Situated beyond that universe was a universe known as Abhirati.

source: དེ་ ན་ དེ་བཞིན་ གཤེགས་པ་ ཐམས་ཅད་ ཡོད་པ ས་ རྒྱགས་པ་ ཡང་དག་ བཅོམ་ ཞེས་ བྱ་བ་ བཞུགས་ ཏེ་
en: There resided the thus-gone Conqueror of the Conceited View That Everything Exists.

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ རྒྱལ་པོ འི་ ཁྱུ་མཆོག་ ཅེས་བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Royal Leader.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ རྡུལ་མེད་ ཅེས་བྱ་བ་ ཡོད་ དེ །_
en: $546 Situated beyond that universe was a universe known as Viraja .

source: བཅོམ་ལྡན་འདས་ དེས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྒྱལ་ཚབ་ མེ་ཏོག་ ཀུན་ ཏུ་ བལྟས་ ཞེས་ བྱ་བ་ བཏང་ ངོ་ །_།
en: This blessed one now dispatched his regent, the bodhisattva Facing Flowers.

source: དེ འི་ ཡང་ འདབ་ཆགས་ ན་ འཇིག་རྟེན་ གྱི་ ཁམས་ མེ་ཏོག་ སྣ་ཚོགས་ ཞེས་ བྱ་བ་ ཡོད་ དེ །_
en: $547 Situated beyond that universe was a universe known as Nānāpuṣpa.
